import random
from telegram.ext import run_async, Filters
from telegram import Message, Chat, Update, Bot, MessageEntity
from cinderella import dispatcher
from cinderella.modules.disable import DisableAbleCommandHandler

ABUSE_STRINGS = (

    
    "MADARCHOD",
    "Bhenchod ",
    "तेरी बहन अभी तक सोई नही जो मुझे फिर याद कर लिया इतना पसन्द आया मेरा लोडा तेरी बहन और बेटी को जो अब फिर चुदने को तैयार हो गई तो ऐसा कर तेरी 👩‍👧बहन की चूत के 💅बाल साफ कर तेरी माँ 👩‍❤️‍👩को मेरे लोडे की मालिश के लिए भेज और तेरी 👩‍👩‍👧बेटी को मेरे टट्टे चूसने के लिए बोल तेरी बहन की👄 चूत 👅लाल करने अभी आया💪💪 🤞🤞🤞🤞


 टपक मादरचोद रँडी के बीज
तेरी मां की चुत मे डीजे बजावा

 रंडी के बीज 
तेरी मां की चुत मे आग लगाउ
तोरी बहन की बोडी मे हमारा लंड घाल देम टपक साले



का रे मादरचोद, गदहे के लंड से चुडेगा या कंडोम लगा के अपनी गाड़ मरवाएगा, बोल ना हरामखोर,तू अपनी रेट बता मादरचोद, लेकिन अपनी गाड़ एक बार मरवा ले मुझसे गांडू, जब तेरा धंधा ही गाड़ मरवाने का है तो फिर शर्म क्यो कर रहा है मादरचोद गांडू, खुल के बोल ना बहन के दल्ले


 सुन  तेरी बहन की चूत में सीज फायर कर रहा हु रात भर में की तेरी बहन की चूत खून के आंसू रोयेगी ।। 
हर 20 सेकण्ड पे उसके फ़टे भोसड़े से रक्त का जलजला निकल रहा है और आखिरकार तेरी बहन का भोसड़ा एक सड़ी हुई पूड़ी की तरह महकने लगेगा।

अब तेरी बहन अपनी चूत की खुजली के लिए लण्ड खोजेगी दर बदर 😉 तब उसे कोई चोदेगा भी नही ।

अरे हा तेरी बहन की सडी चूत की दहकती गर्मी तेरा जीजा खारोल जरूर पूरा कर सकता है



तेरी अम्मी के भोसड़े मे, जामा मस्जिद के, बुखारी का ढीला लण्ड मादरचोद* 😜
तेरी अम्मी के भोसड़े में *भाला* ले कर घुस जाउगा और तेरी आपा और बाजी के ढीले ढीले बोबो को *छतरी* से दबाउगा 😛

💣 *तेरी खालू कि फ़टी भोसड़ी को, फेवीक्वीक से टाइट करके चोदु रे मादरचोद* 😜



 तेरी अप्पी को चोद रहा हु, बोबे मस्त है रे तेरी अप्पी के, और सुन मादरचोद, हरामखोर, कल शाम को अपनी अम्मी को लेकर आना 😀😀😀😀😀


तेरी मम्मी साली रंडी को पूरी नंगी करके पटक पटक के चोदूंगा मादरचोद साले  आतंकवादी , देशद्रोही*

*तेरी दीदी साली वैश्या की गोरी गोरी गुलाबी गुलाबी चूत फाड़ डालूंगा अपने 9 इंच लंबे लौड़े से , समझा बहन के लौड़े साले नमक हराम , देश के गद्दार साले दंगाई*

‌*तेरे पूरे खानदान को चोद डालूंगा मै अपने 9 इंच लंबे लंड से , समझा साले कोठे की पैदाइश साले रण्डी की औलाद*
‌
*तेरी छोटी बहन साली कुतिया की चिकनी चिकनी बिना बाल वाली चूत के चिथड़े उड़ा डालूंगा अपने 9 इंच लंबे लंड से , समझा बेटीचोद साले बहन के लौड़े*

*तेरा बाप हूं मैं मादरचोद साले gandu , तू मेरी नाजायज औलाद है , जा जाके पूछ अपनी मम्मी साली रंडी से*



तेरी अप्पी बता रही थी कि तू बहुत बड़ा मादर चोद है, तूने ही अपनी अम्मी को चोद कर अपनी अप्पी पैदा की, और तू बहुत बड़ा गांडू भी है, कितने रेट है तेरे गाड़ मरवाने के ??
और ये भी बता कि गाड़ मरवाता है, कंडोम लगा के या बिना कण्डोम के ? तेल लेकर तू आएगा या मैं ही जापानी तेल लेकर आउ ?



तेरी माँ पक्का RED LIGHT में धंधा करती होगी उस एरीए में रंडीयो को समुह में चोदते हैं और जब समुह चोदन के बाद औलाद पैदा होता हैं तो उसके दो लंड होते हैं और उसके साथ दोहरी चुत वाली लड़की भी पैदा होती हैं और मजे की बात ए हैं कि ए अपने दोनों लंड अपनी दोहरी चुत वाली बहन के अंदर ही डाल के रखता हैं ए रंडी का जना 

इसे कहते हैं पेलना, गाली देने में मैने PHD की हैं बुलाओ इसे अगर इसके गांड से खुन नहीं निकाला तो कहना



 आज तेरी माँ के भोसड़े में 786 बोफोर्स तोंपो की सलामी दुंगा। उसके बाद उस रंडी के भोसड़े के परखच्चे ऐसे उड़ जाएंगे कि उस फटे भोसड़े पे चंडीगढ़ एयरपोर्ट का शिलान्यास करूँगा। तेरी माँ के भोसड़े से ले के बोबों तक हवाई पट्टी बनाकर उसपर भारतीय वायुसेना में मिराज-17 बमवर्षक विम्मान लैंड करवाऊंगा मादरचोद वेस्या पुत्र 😂😂😂

 भोसड़ी के 👉लण्ड पे घुँघरू बांध के तेरे और तेरे बाप की इतनी गाँड़ मरूँगा की मुहल्ले वाले कन्फ्यूज़्ड हो जाएंगे कि चुदाई चल रही है या भजन 😂😂मुझे बता.....मै तेरी माँ रोज़ जम के चोदुंगा वो भी फ्री में.और तेरी बहनको रंडी बना के कोठे पे बैठा दूंगा.और तुझे हिजड़ो की फ़ौज का कुछ ज्यादा ही शौक है..उनके बिना तू कभी किसी से नहीं लड़ सकता है तेरी हिजड़ो की फ़ौज को मेरा एक मैसेज है की इसे पढने के बादअगर उन्होंने कभी भी गन्दगी फैलाई तो उनकी बहनों को ऐसे चोदुंगा की चूत और गांड के छेद एक ही हो जायेगे

 भेन के दल्ले जीजी चोद के शैलाब ला देंगे। लवड़े की चोट तोहार माई की भोसड़िया पे ऐसी मारेंगे जैसन ज्वालामुखी में जलजल

ा आया हो। हमरे लवड़े की चोट से तोहार माई बहिनियां सबका जोबन खिल जायेगा बे और सब रंडियां तोहार खानदान की गंडिया उठाई उठाई के हुचक हुचक के हमार लवड़ा भीतर तक लेगी बे। और मुठ मार के लवड़े का पावन रस हलक में साइड में आती जाती रोज़ लेगी।

 टपक रे सस्ती रंडी के परखनली
पुत्र आज तेरी माँ के", 
    "Randi Ke Aulad",
    "Betichod", 
    "Tatte", 
    "Chutmarike", 
    "Adhi luli", 
    "Gand Ke Chopadike", 
    "laude", 
    "mother fucker"
  )

SONG_STRINGS = (
    "Mere Dost Hai Nakli La La La La", 
    "My friens are fake la la la la"
 )

@run_async
def abuse(bot: Bot, update: Update):
    bot.sendChatAction(update.effective_chat.id, "typing") # Bot typing before send messages
    message = update.effective_message
    if message.reply_to_message:
      message.reply_to_message.reply_text(random.choice(ABUSE_STRINGS))
    else:
      message.reply_text(random.choice(ABUSE_STRINGS))

@run_async
def sing(bot: Bot, update: Update):
    bot.sendChatAction(update.effective_chat.id, "typing") # Bot typing before send messages
    message = update.effective_message
    if message.reply_to_message:
      message.reply_to_message.reply_text(random.choice(SONG_STRINGS))
    else:
      message.reply_text(random.choice(SONG_STRINGS))

__help__ = """
- /abuse : Abuse someone in Hindi/English
- /sing : First lines of some random Engish Songs.
"""

__mod_name__ = "😡ABUSE😡"

ABUSE_HANDLER = DisableAbleCommandHandler("abuse", abuse)
SING_HANDLER = DisableAbleCommandHandler("sing", sing)

dispatcher.add_handler(ABUSE_HANDLER)
dispatcher.add_handler(SING_HANDLER)
